fio_opmix_randread_297838a4-5a65-4c97-a708-43f35c4b1f46.log
throughput-test-job: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=rados, iodepth=8
fio-3.38-7-ga1916-dirty
Starting 1 process

throughput-test-job: (groupid=0, jobs=1): err= 0: pid=818993: Sat Nov 30 16:11:25 2024
  read: IOPS=14.4k, BW=56.1MiB/s (58.8MB/s)(3364MiB/60001msec)
    slat (usec): min=11, max=553, avg=23.57, stdev= 8.00
    clat (usec): min=239, max=2399, avg=531.46, stdev=170.93
     lat (usec): min=264, max=2428, avg=555.04, stdev=170.59
    clat percentiles (usec):
     |  1.00th=[  285],  5.00th=[  314], 10.00th=[  334], 20.00th=[  375],
     | 30.00th=[  416], 40.00th=[  457], 50.00th=[  506], 60.00th=[  553],
     | 70.00th=[  603], 80.00th=[  668], 90.00th=[  775], 95.00th=[  865],
     | 99.00th=[ 1004], 99.50th=[ 1045], 99.90th=[ 1156], 99.95th=[ 1237],
     | 99.99th=[ 1582]
   bw (  KiB/s): min=55808, max=58584, per=100.00%, avg=57410.67, stdev=555.75, samples=120
   iops        : min=13952, max=14646, avg=14352.67, stdev=138.94, samples=120
  lat (usec)   : 250=0.01%, 500=48.88%, 750=39.37%, 1000=10.73%
  lat (msec)   : 2=1.02%, 4=0.01%
  cpu          : usr=34.44%, sys=4.78%, ctx=802920, majf=0, minf=3
  IO depths    : 1=0.1%, 2=0.1%, 4=5.9%, 8=94.1%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=861160,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=56.1MiB/s (58.8MB/s), 56.1MiB/s-56.1MiB/s (58.8MB/s-58.8MB/s), io=3364MiB (3527MB), run=60001-60001msec