fio_opmix_randwrite_297838a4-5a65-4c97-a708-43f35c4b1f46.log
throughput-test-job: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=rados, iodepth=8
fio-3.38-7-ga1916-dirty
Starting 1 process

throughput-test-job: (groupid=0, jobs=1): err= 0: pid=817960: Sat Nov 30 16:09:17 2024
  write: IOPS=171, BW=684KiB/s (701kB/s)(40.1MiB/60038msec); 0 zone resets
    slat (usec): min=15, max=127, avg=40.43, stdev=12.56
    clat (msec): min=18, max=115, avg=46.72, stdev= 9.43
     lat (msec): min=19, max=115, avg=46.76, stdev= 9.43
    clat percentiles (msec):
     |  1.00th=[   33],  5.00th=[   35], 10.00th=[   37], 20.00th=[   40],
     | 30.00th=[   41], 40.00th=[   43], 50.00th=[   46], 60.00th=[   48],
     | 70.00th=[   51], 80.00th=[   54], 90.00th=[   59], 95.00th=[   64],
     | 99.00th=[   75], 99.50th=[   81], 99.90th=[  109], 99.95th=[  111],
     | 99.99th=[  115]
   bw (  KiB/s): min=  440, max=  848, per=99.97%, avg=684.13, stdev=104.68, samples=120
   iops        : min=  110, max=  212, avg=171.03, stdev=26.17, samples=120
  lat (msec)   : 20=0.01%, 50=66.97%, 100=32.88%, 250=0.14%
  cpu          : usr=0.71%, sys=0.08%, ctx=9987, majf=0, minf=50
  IO depths    : 1=0.1%, 2=0.1%, 4=3.4%, 8=96.6%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10270,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=684KiB/s (701kB/s), 684KiB/s-684KiB/s (701kB/s-701kB/s), io=40.1MiB (42.1MB), run=60038-60038msec