fio_simple_randwrite_297838a4-5a65-4c97-a708-43f35c4b1f46.log
throughput-test-job: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=rados, iodepth=8
fio-3.38-7-ga1916-dirty
Starting 1 process

throughput-test-job: (groupid=0, jobs=1): err= 0: pid=815126: Sat Nov 30 16:05:30 2024
  write: IOPS=169, BW=677KiB/s (694kB/s)(39.7MiB/60056msec); 0 zone resets
    slat (usec): min=15, max=137, avg=40.07, stdev=12.69
    clat (msec): min=24, max=117, avg=47.20, stdev=10.35
     lat (msec): min=24, max=117, avg=47.24, stdev=10.35
    clat percentiles (msec):
     |  1.00th=[   33],  5.00th=[   35], 10.00th=[   36], 20.00th=[   39],
     | 30.00th=[   41], 40.00th=[   43], 50.00th=[   45], 60.00th=[   48],
     | 70.00th=[   52], 80.00th=[   56], 90.00th=[   63], 95.00th=[   67],
     | 99.00th=[   78], 99.50th=[   82], 99.90th=[   95], 99.95th=[  101],
     | 99.99th=[  101]
   bw (  KiB/s): min=  448, max=  896, per=99.96%, avg=677.40, stdev=114.69, samples=120
   iops        : min=  112, max=  224, avg=169.35, stdev=28.67, samples=120
  lat (msec)   : 50=66.84%, 100=33.13%, 250=0.03%
  cpu          : usr=0.68%, sys=0.09%, ctx=9818, majf=0, minf=44
  IO depths    : 1=0.1%, 2=0.1%, 4=3.7%, 8=96.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10169,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=677KiB/s (694kB/s), 677KiB/s-677KiB/s (694kB/s-694kB/s), io=39.7MiB (41.7MB), run=60056-60056msec